[
	"If Pizza sizes were given in area not diameter, you’d see instantly that a 7 inch is less than half the size of a 10 inch pie",
	"According to the song, Rudolph’s nose is shiny, which means it reflects rather than emits light. Useless for navigating fog.",
	"The most boring constellation: Triangulum Australis. A profound lack of imagination – any 3 stars in the sky makes a triangle",
	"Just an FYI: Roman Numerals have no zero because it was not yet invented, allowing year 2000 to be written efficiently as MM.",
	"Slowest pitch in Baseball to reach catcher? 30mph, thrown at 45-deg angle. Any slower at any other angle hits ground.",
	"Apollo in 1969. Shuttle in 1981. Nothing in 2011. Our space program would look awesome to anyone living backwards thru time.",
	"With automatic spell checkers running unleashed over what we compose, our era is that of correctly spelled typos.",
	"If each dead person became a ghost, there’d be more than 100-billion of them haunting us all. Creepy, but cool.",
	"More evidence my 14yr old daughter is a Geek: after prompting me to ask if she knew any jokes about sodium, she replied, “Na”",
	"If you removed all the arteries, veins, & capillaries from a person’s body, and tied them end-to-end…the person will die.",
	"In my NCAAwrestling days I dreamt of a hold I called the “Double Tidal Lock” inspired by Earth-Moon physics.",
	"Curiously, light-loving GREEN plants reject the Sun’s GREEN light, reflecting it back at you, which is why they look GREEN",
	"If gridiron were a timeline, w/ Big Bang at one goal, then cavemen to now spans thickness of single turf-blade at other goal.",
	"Next time you’re stunned by large Moon on horizon, bend over and view it between your legs. The effect goes away entirely.",
	"Just to settle it once and for all: Which came first the Chicken or the Egg? The Egg — laid by a bird that was not a Chicken",
	"In Terminator, only living things can time-travel. But hair is dead. So Arnold should’ve landed in LA not only naked but bald",
	"Don’t know if it’s good or bad that a Google search on “Big Bang Theory” lists the sitcom before the origin of the Universe",
	"Curious that a bulletproof vest does not protect the neck, head, or groin. I consider these body parts important. ",
	"Astro-educators remain busy undoing damage caused by 1973 hit album “Dark Side of the Moon.” Nope. All sides get sunlight.",
	"Wanna lose 1200 Calories a month? Drink a liter of ice water a day. You burn the energy just raising the water to body temp.",
	"Just an FYI:Within two minutes of flight, the Shuttle’s air-speed exceeds that of a bullet fired from an M16 assault rifle.",
	"Curious that we spend more time congratulating people who have succeeded than encouraging people who have not.",
	"In 5-billion yrs the Sun will expand & engulf our orbit as the charred ember that was once Earth vaporizes. Have a nice day.",
	"Just an FYI: “Thursday the 12th” is just as rare as “Friday the 13th”.",
	"Need a distraction today? Not only does 12+1=11+2, but the letters “twelve plus one” rearrange to give you “eleven plus two”",
	"Principles of modern law assert that you’re innocent until proven guilty. Yet airport security is the exact opposite of this.",
	"Ages for which you’re in the “prime” of your life: 2 3 5 7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67 71 73 79 83 89 97 101",
	"I’ve come to conclude that Fettucini Alfredo is just Mac-and-Cheese for food snobs.",
	"I think of space not as the final frontier but as the next frontier. Not as something to be conquered but to be explored.",
	"Just an observation: I’ve never, ever, ever, ever, ever, heard a female voice as the narrator of a movie trailer.",
	"Ever see DebatingTeams? They don’t know in advance what side of a case they’re required to argue. They make the best Lawyers.",
	"If aliens did visit us, I’d be embarrassed to tell them we still dig fossil fuels from the ground as a source of energy.",
	"Would a NASA reality show “Lunar Shore” be morepopular than “Jersey Shore”?Civilization”s future depends on that answer",
	"just an FYI: There are 2 kinds of people in the world — those who divide everybody into 2 kinds of people & those who don’t.",
	"Without physics there’d be no Fashion Channel — there’d be no TV. But w/o fashion, physicists might just be naked. Not good.",
	"If the surviving miners are heroes (rather than victims) then what do you call the NASA & Chilean Engineers who saved them?",
	"Italy valued cathedrals while Spain valued explorers. So worldwide, five times as many people speak Spanish than Italian",
	"A bullet fired level from a gun will hit ground at same time as a bullet dropped from the same height. Do the Physics.",
	"More air molecules in breath of air than breaths of air in Earth’s atmosphere. Some air you inhale was exhaled by Cleopatra.",
	"Average time between full moons is 29.53 days. Which means February will occasionally not get one, and will never have two.",
	"286 octillion cars would not fit on our planet’s surface. Would require 10-quadrillion fully paved Earths to park them all.",
	"Just an FYI: It takes twice as much energy to throw a baseball 100mph than it does to throw one at 70mph. Do The Physics",
	"Effective Car Commercials: Now every time I pass a KIA “Soul” in the street I’m disappointed the driver is not a Hamster.",
	"Cosmic objects with elements named in their honor:Sun (helium), Mercury (mercury), Earth (telerium), Moon (selenium)",
	"Just an FYI: If scientists invented the legal system, eye witness testimony would be inadmissible evidence.",
	"Other than the waging of War, the ISS (assembled by Shuttle) is the most successful collaboration of nations there ever was.",
	"TheBigBangTheory: When geeky scientists can be main characters in a hit primetime series, you know there’s hope for the world",
	"Not enough people do things that leave others to wonder.RT @BrianMendicino: Wondering why @neiltyson is watching Glee.",
	"Math is the language of the universe. So the more equations you know, the more you can converse with the cosmos.",
	"Geek e-mail signoff: No trees were killed to send this message, but a large number of electrons were terribly inconvenienced."
]